app/views/cat_rental_requests/_cat_rental_requests.html.erb

    <tr>
      <th colspan="2"><%= Cat.find(request.cat_id).name %></th>
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]