app/views/cat_rental_requests/_cat_rental_requests_form.html.erb

    <option disabled>Select a Color</option>
    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"