app/controllers/cat_rental_requests_controller.rb

  def show
    @request = CatRentalRequest.find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]